---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PlanRegionViewRange
source: html/a753dac6-33b5-f6d2-14e0-18908b65b5ae.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PlanRegionViewRange Property

"View Range"

## Syntax (C#)
```csharp
public static ForgeTypeId PlanRegionViewRange { get; }
```